

// https://www.proxy-list.download/api/v1/get?type=http&anon=elite&country=US

Функция ЗапросПрокси()

	ИмяСервера = "https://www.proxy-list.download/";
	URL = "api/v1/get?type=https&anon=transparent";
	
	HTTPЗапрос = Новый HTTPЗапрос(URL);

	HTTP = Новый HTTPСоединение(ИмяСервера,443);
	
	ОтветHTTP = HTTP.Получить(HTTPЗапрос);

	Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();

	Сообщить(Ответ);
	Возврат Ответ;

КонецФункции

Процедура ВывестиМассив()
Массив = Новый Массив();
Массив = СтрРазделить(ЗапросПрокси(), ":");

Для Каждого М из Массив Цикл
	Сообщить(М);
	КонецЦикла;

КонецПроцедуры

ВывестиМассив();