//http://pubproxy.com/api/proxy
Функция ЗапросПрокси()

	ИмяСервера = "http://pubproxy.com";
	URL = "api/proxy?format=txt&type=http&https=true";
	
	HTTPЗапрос = Новый HTTPЗапрос(URL);

	HTTP = Новый HTTPСоединение(ИмяСервера);
	
	ОтветHTTP = HTTP.Получить(HTTPЗапрос);

	Ответ = ОтветHTTP.ПолучитьТелоКакСтроку();

	Сообщить(Ответ);
	Возврат Ответ;

КонецФункции

Процедура НазначениеИПиПорта()

	Массив = Новый Массив();
	Массив = СтрРазделить(ЗапросПрокси(), ":");

	ProxyIP = Массив[0];
	ProxyPort = Массив[1];

КонецПроцедуры



// Процедура ВывестиМассив()
// Массив = Новый Массив();
// Массив = СтрРазделить(ЗапросПрокси(), ":");

// Сообщить(Массив[1]);

// Для Каждого М из Массив Цикл
// 	Сообщить(М);
// 	КонецЦикла;

// КонецПроцедуры

// ВывестиМассив();

